OpenNuvoton/ISPTool/Firmwares/NUC029xGE_BSP/Library/Device/Nuvoton/NUC029xGE/Include/NUC029xGE.h
#define SYS_SRAM_BISTSTS_USBBEND_Pos     (20)                                              /*!< SYS_T::SRAM_BISTSTS: USBBEND Position  */
#define SYS_SRAM_BISTSTS_USBBEND_Msk     (0x1ul << SYS_SRAM_BISTSTS_USBBEND_Pos)           /*!< SYS_T::SRAM_BISTSTS: USBBEND Mask      */

#define SYS_TSOFFSET_VTEMP_Pos           (0)                                               /*!< SYS_T::TSOFFSET: VTEMP Position        */
#define SYS_TSOFFSET_VTEMP_Msk           (0xffful << SYS_TSOFFSET_VTEMP_Pos)               /*!< SYS_T::TSOFFSET: VTEMP Mask            */

/**@}*/ /* SYS_CONST */



typedef struct
{


    /**
     * @var SYS_INT_T::IRQSRC
     * Offset: 0x00  Interrupt Source Identity Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |INTSRC    |Interrupt Source
     * |        |          |Define the interrupt sources for interrupt event.
     * |        |          |IRQSRC[0].0 - BOD INT
     * |        |          |IRQSRC[0].1 - 0
     * |        |          |IRQSRC[0].2 - 0
     * |        |          |IRQSRC[1].0 - WDT INT
     * |        |          |IRQSRC[1].1 - WWDT_INT
     * |        |          |IRQSRC[1].2 - 0
     * |        |          |IRQSRC[2].0 - EINT0, external interrupt 0 from PA.0/PD.2/PE.4
     * |        |          |IRQSRC[2].1 - EINT2, external interrupt 2 from PC.0
     * |        |          |IRQSRC[2].2 - EINT4, external interrupt 4 from PE.0
     * |        |          |IRQSRC[3].0 - EINT1, external interrupt 1 from PB.0/PD.3/PE.5
     * |        |          |IRQSRC[3].1 - EINT3, external interrupt 3 from PD.0
     * |        |          |IRQSRC[3].2 - EINT5, external interrupt 5 from PF.0
     * |        |          |IRQSRC[4].0 - GPA_INT
     * |        |          |IRQSRC[4].1 - GPB_INT
     * |        |          |IRQSRC[4].2 - 0
     * |        |          |IRQSRC[5].0 - GPC_INT
     * |        |          |IRQSRC[5].1 - GPD_INT
     * |        |          |IRQSRC[5].2 - GPE_INT
     * |        |          |IRQSRC[5].3 - GPF_INT
     * |        |          |IRQSRC[6].0 - PWM1 INT
     * |        |          |IRQSRC[6].1 - BRAKE0_INT
     * |        |          |IRQSRC[6].2 - 0
     * |        |          |IRQSRC[6].3 - 0
     * |        |          |IRQSRC[7].0 - PWM1_INT
     * |        |          |IRQSRC[7].1 - BRAKE1_INT
     * |        |          |IRQSRC[7].2 - 0
     * |        |          |IRQSRC[7].3 - 0
     * |        |          |IRQSRC[8].0 - TMR0_INT
     * |        |          |IRQSRC[8].1 - 0
     * |        |          |IRQSRC[8].2 - 0
     * |        |          |IRQSRC[9].0 - TMR1_INT
     * |        |          |IRQSRC[9].1 - 0
     * |        |          |IRQSRC[9].2 - 0
     * |        |          |IRQSRC[10].0 - TMR2_INT
     * |        |          |IRQSRC[10].1 - 0
     * |        |          |IRQSRC[10].2 - 0
     * |        |          |IRQSRC[11].0 - TMR3_INT
     * |        |          |IRQSRC[11].1 - 0
     * |        |          |IRQSRC[11].2 - 0
     * |        |          |IRQSRC[12].0 - UART0_INT
     * |        |          |IRQSRC[12].1 - UART2_INT
     * |        |          |IRQSRC[12].2 - 0
     * |        |          |IRQSRC[13].0 - UART1_INT
     * |        |          |IRQSRC[13].1 - 0
     * |        |          |IRQSRC[13].2 - 0
     * |        |          |IRQSRC[14].0 - SPI0_INT
     * |        |          |IRQSRC[14].1 - 0
     * |        |          |IRQSRC[14].2 - 0
     * |        |          |IRQSRC[15].0 - SPI1_INT
     * |        |          |IRQSRC[15].1 - 0
     * |        |          |IRQSRC[15].2 - 0
     * |        |          |IRQSRC[16].0 - 0
     * |        |          |IRQSRC[16].1 - 0
     * |        |          |IRQSRC[16].2 - 0
     * |        |          |IRQSRC[17].0 - 0
     * |        |          |IRQSRC[17].1 - 0
     * |        |          |IRQSRC[17].2 - 0
     * |        |          |IRQSRC[18].0 - I2C0_INT
     * |        |          |IRQSRC[18].1 - 0
     * |        |          |IRQSRC[18].2 - 0
     * |        |          |IRQSRC[19].0 - I2C1_INT
     * |        |          |IRQSRC[19].1 - 0
     * |        |          |IRQSRC[19].2 - 0
     * |        |          |IRQSRC[20].0 - 0
     * |        |          |IRQSRC[20].1 - 0
     * |        |          |IRQSRC[20].2 - 0
     * |        |          |IRQSRC[21].0 - 0
     * |        |          |IRQSRC[21].1 - 0
     * |        |          |IRQSRC[21].2 - 0
     * |        |          |IRQSRC[22].0 - USCI0_INT
     * |        |          |IRQSRC[22].1 - USCI1_INT
     * |        |          |IRQSRC[22].2 - USCI2_INT
     * |        |          |IRQSRC[23].0 - USBD_INT
     * |        |          |IRQSRC[23].1 - 0
     * |        |          |IRQSRC[23].2 - 0
     * |        |          |IRQSRC[24].0 - SMC0_INT
     * |        |          |IRQSRC[24].1 - SMC1_INT
     * |        |          |IRQSRC[24].2 - 0
     * |        |          |IRQSRC[25].0 - ACMP_INT
     * |        |          |IRQSRC[25].1 - 0
     * |        |          |IRQSRC[25].2 - 0
     * |        |          |IRQSRC[26].0 - PDMA_INT
     * |        |          |IRQSRC[26].1 - 0
     * |        |          |IRQSRC[26].2 - 0
     * |        |          |IRQSRC[27].0 - 0
     * |        |          |IRQSRC[27].1 - 0
     * |        |          |IRQSRC[27].2 - 0
     * |        |          |IRQSRC[28].0 - PWRWU_INT
     * |        |          |IRQSRC[28].1 - 0
     * |        |          |IRQSRC[28].2 - 0
     * |        |          |IRQSRC[29].0 - ADC_INT
     * |        |          |IRQSRC[29].1 - 0
     * |        |          |IRQSRC[29].2 - 0
     * |        |          |IRQSRC[30].0 - IRC_INT
     * |        |          |IRQSRC[30].1 - CLKD_INT
     * |        |          |IRQSRC[30].2 - SRAMF_INT
     * |        |          |IRQSRC[31].0 - RTC_INT
     * |        |          |IRQSRC[31].1 - 0
     * |        |          |IRQSRC[31].2 - 0
     * @var SYS_INT_T::NMISEL
     * Offset: 0x80  NMI Source Interrupt Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |NMISEL    |NMI Interrupt Source Selection
     * |        |          |The NMI interrupt to Cortex-M0 can be selected from one of the peripheral interrupt by setting NMISEL.
     * |[8]     |NMIEN     |NMI Interrupt Enable Bit (Write Protect)
     * |        |          |0 = NMI interrupt Disabled.
     * |        |          |1 = NMI interrupt Enabled.
     * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
     */


    __I  uint32_t IRQSRC[32];            /*!< [0x0000-0x007C] MCU IRQn(n=0~31) Interrupt Source Identity Register       */
    __IO uint32_t NMISEL;                /*!< [0x0080] NMI Source Interrupt Select Control Register                     */


} SYS_INT_T;

/**
    @addtogroup INT_CONST INT Bit Field Definition
    Constant Definitions for INT Controller
@{ */

#define INT_INTSRC_INTSRC_Pos             (0)                                               /*!< SYS_INT_T::INTSRC: INTSRC Position           */
#define INT_INTSRC_INTSRC_Msk             (0xful << INT_INTSRC_INTSRC_Pos)                  /*!< SYS_INT_T::INTSRC: INTSRC Mask               */

